python_basics/basic exercises.tex
% Created 2023-01-05 Thu 10:47
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Shashank Vatedka}
\date{\today}
\title{Simple exercises in python}
\hypersetup{
 pdfauthor={Shashank Vatedka},
 pdftitle={Simple exercises in python},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Basic python}
\label{sec:org67d1718}
The following exercises will require some more concepts than those covered in the videos (e.g., how to read files, and how to take user inputs).
\begin{itemize}
\item Write a program to compute the n'th number in the Fibonacci sequence (using recursion)
\item Write a program to compute the binomial coefficient (using functions and recursion)
\item Write a program to open a text file, and compute the frequency of occurrence of each of the characters in the english alphabet
\item Write a function that does the following: given a string, and a text file as input, output the number of occurrences of the string within the file.
\item Write a program to implement a 2-player \href{https://playtictactoe.org/}{tic-tac-toe} game (by taking user inputs)
\end{itemize}

\section{Numpy and matplotlib}
\label{sec:orgcd89947}
\end{document}